[
  {
    "title": "IntoTheDeep - Team 8569 RoboKnights Robotics",
    "description": "Before I arrived at NCSSM, I had never known that I could get involved with robotics. But ever since I've joined the RoboKnights at the beginning of junior year, I've been building systems that turn ideas into reality. Throughout my rookie year, I've learned how to create PID controllers, create controllable systems, implement vision systems, and more. Just recently at the 2025 Chicago Robotics Invitation, I implemented a camera vision system that leveraged on board computing to spot, identify, and locate game pieces on the field. My system even went as far as to move the arm to the game piece for pickup. I'm excited to be the captain of RoboKnights for the upcoming season, and hope to make strides in the FTC world.",
    "langs": ["onshape", "java", "git"],
    "link": "https://roboknights.net",
    "source": "https://github.com/ftc8569/2024-IntoTheDeep",
    "date": "September 2024 - Present"
  },
  {
    "title": "SightLine",
    "description": "SightLine is a pair of AI powered glasses that help visually impaired people navigate the world. It combines a mobile app with powerful server infrastructure to enable the glasses to see the world, and allow the user to ask about their surroundings. By simply asking, \"Hey SightLine, where is the nearest chair\", you can learn about not only where the nearest chair is, but how far it is from you, in which direction, and how many steps it will take to get there.",
    "langs": ["onshape", "swiftui", "docker", "kubernetes", "python", "git"],
    "link": "https://www.intel.com/content/www/us/en/corporate/artificial-intelligence/winner2025.html#tab-blade-1-0",
    "source": null,
    "date": "June 2025 - July 2025"
  },
  {
    "title": "North Carolina TSA Conference App",
    "description": "This app was designed to help facilitate the North Carolina TSA State Conference. It posts the agenda, sends out notifications, makes resources available, and more. I was the development lead, and soley developed the backend and management website. I also was responsible for hosting, and set up kubernetes for the application and connected it with two dedicated databases, redis and postgresql. I did a lot of the internal programming for the app, and did some of the UI work.",
    "langs": [
      "nodejs",
      "react",
      "typescript",
      "html",
      "css",
      "tailwindcss",
      "nextjs",
      "git",
      "docker",
      "kubernetes",
      "postgresql",
      "redis",
      "golang",
      "expo",
      "python"
    ],
    "link": "https://apps.apple.com/us/app/north-carolina-tsa-conference/id6743861783",
    "source": "https://github.com/Prorickey/northcarolinatsa",
    "date": "March 2025 - Present"
  },
  {
    "title": "SMathHacks Hackathon -> ARES-M",
    "description": "For this project, I worked in a team of four to develop a prototype weather pod that could be used on Mars to collect data and relay it back to Earth. I was responsible for the software side of the project, which included developing a web interface to display the data collected by the pod. The project was developed in a 36-hour hackathon. The team and I are continuing this project and will be installing a weather station at NCSSM in late April/early May.",
    "langs": [
      "nodejs",
      "react",
      "typescript",
      "html",
      "css",
      "tailwindcss",
      "nextjs",
      "postgresql",
      "git"
    ],
    "link": "https://devpost.com/software/ares-udeksp",
    "source": "https://github.com/Prorickey/SMathHacks25",
    "date": "Febuary 8-9, 2025"
  },
  {
    "title": "NC(SMC)² Math Competition Website",
    "description": "This website hosts information, practice sets, schedules, and the sign-up for the annual NC(SMC)² competition hosted at NCSSM. NC(SMC)² is a state-wide math competition that invites middle schoolers to compete online in three rounds to solve math problems. I helped build the website from scratch this year and set up the hosting.",
    "langs": [
      "react",
      "typescript",
      "html",
      "css",
      "tailwindcss",
      "nextjs",
      "docker",
      "kubernetes",
      "nodejs",
      "git"
    ],
    "link": "https://ncsmc2.org",
    "source": "https://github.com/Prorickey/ncsmc2",
    "date": "March 2025 - Present"
  },
  {
    "title": "NCSSM Spoons Game Website",
    "description": "This website hosts NCSSM's annual game of spoons. It helps streamline the setup of the physical game, tracks how the game progresses, and reports fun statistics at the end of the game. It also shows good use of cybersecurity skills and security practices and showcases the use of Kubernetes and Docker to scale applications.",
    "langs": [
      "react",
      "typescript",
      "html",
      "css",
      "tailwindcss",
      "nextjs",
      "golang",
      "docker",
      "kubernetes",
      "nodejs",
      "postgresql",
      "git"
    ],
    "link": "https://ncssm-spoons.com",
    "source": "https://github.com/Prorickey/spoons",
    "date": "January 2025 - Present"
  },
  {
    "title": "Portfolio Website",
    "description": "My portfolio website is the one you're on right now. It contains information about me, project links, and more. I built this to showcase my work and learn some languages and frameworks. This website is built with NextJS, React, and TailwindCSS. The primary languages utilized were Typescript, HTML, and CSS.",
    "langs": [
      "nodejs",
      "react",
      "typescript",
      "html",
      "css",
      "tailwindcss",
      "nextjs",
      "git"
    ],
    "link": "https://prorickey.xyz",
    "source": "https://github.com/Prorickey/website",
    "date": "April 2024 - Present"
  },
  {
    "title": "RoboKnights Website",
    "description": "This website showcases the RoboKnights robotics team at NCSSM. It contains information about the team, the robots we build, and the competitions we participate in. It also includes a blog that the team posts to. I built the website with NextJS, React, and TailwindCSS. The primary languages utilized were typescript, HTML, and CSS.",
    "langs": [
      "nodejs",
      "react",
      "typescript",
      "html",
      "css",
      "tailwindcss",
      "nextjs",
      "postgresql",
      "git"
    ],
    "link": "https://roboknights.net",
    "source": "https://github.com/ftc8569/Website",
    "date": "September 2024 - Present"
  },
  {
    "title": "Minecraft Game Server -> ClassicDupe",
    "description": "I hosted this Minecraft server for a few months during a break from hosting Hiant. This server was a different game mode, but it was a fresh start for me and didn't include my old codebase, which had outdated code and amateur practices. This server featured a more advanced codebase and a more fruitful experience.",
    "langs": [
      "java",
      "mysql",
      "linux",
      "redis",
      "git",
      "mongodb",
      "typescript",
      "nodejs"
    ],
    "link": null,
    "source": "https://github.com/Classicdupe",
    "date": "May 2023 - July 2023"
  },
  {
    "title": "Minecraft Game Server -> Hiant",
    "description": "I hosted this Minecraft server for the most part of three years. Minecraft game servers introduced me to programming, and I gained much of my experience using Java, Docker, Databases, and Git through programming for this server. I also got experience working with small developer teams and managing teams. I shut down the server to focus on school.",
    "langs": ["java", "mysql", "linux", "redis", "git", "mongodb"],
    "link": null,
    "source": "https://github.com/HiantNetwork",
    "date": "November 2021 - August 2024"
  },
  {
    "title": "Notion Calendar Updater",
    "description": "This is a simple GoLang application that updates my Notion calendar with events in multiple Google calendars. Before, I had to deal with multiple Google calendars to keep up with things, but with this, everything is centralized in my Notion calendar. I created this application before the Notion Calendar was released.",
    "langs": ["golang", "git"],
    "link": null,
    "source": "https://github.com/Prorickey/NotionCalendarUpdater",
    "date": "May 2024 - July 2024"
  }
]
