[
  {
    "title": "Portfolio Website",
    "description": "My portfolio website is this website your on right now. It contains information about me, project links and more. I built this to showcase my work and learn some languages and frameworks along the way. This website is built with NextJS, React and Tailwindcss. The primary languages utilized were typescript, html and css.",
    "langs": [
      "nodejs",
      "react",
      "typescript",
      "html",
      "css",
      "tailwindcss",
      "nextjs"
    ],
    "link": "https://prorickey.xyz",
    "source": "https://github.com/Prorickey/website",
    "date": "April 2024 - Present"
  },
  {
    "title": "Notion Calendar Updater",
    "description": "This is a simple GoLang application which updates my calendar in notion with events in multiple google calendars. Before, I was having to deal with multiple google calendars to keep up with stuff, but with this, everything is centralized in my notion calendar.",
    "langs": ["golang"],
    "link": null,
    "source": "https://github.com/Prorickey/NotionCalendarUpdater",
    "date": "May-July 2024"
  },
  {
    "title": "NCSSM Spoons Game Website",
    "description": "This website is used to host NCSSM's annual game of spoons. It helps streamline the setup of the physical game, tracks how the game progresses, and reports fun statistics at the end of the game. It also shows good use of cybersecurity skills and good security practices. Alongside that, it showcases the use of kubernetes and docker to scale applications.",
    "langs": [
      "react",
      "typescript",
      "html",
      "css",
      "tailwindcss",
      "nextjs",
      "golang",
      "docker",
      "kubernetes",
      "nodejs",
      "postgresql",
      "git"
    ],
    "link": "https://ncssm-spoons.com",
    "source": null,
    "date": "January 2025 - Present"
  },
  {
    "title": "SMathHacks Hackathon -> ARES-M",
    "description": "In this project, I worked in a team of four to develop a prototype weather pod that could be used on mars to collect data and relay it back to earth. I was responsible for the software side of the project, which included developing a web interface to display the data collected by the pod. The project was developed in a 36 hour hackathon.",
    "langs": ["nodejs", "react", "typescript", "html", "css", "tailwindcss", "nextjs", "postgresql"],
    "link": "https://devpost.com/software/ares-udeksp",
    "source": "https://github.com/Prorickey/SMathHacks25",
    "date": "Febuary 8-9, 2025"
  }
]
